#include <ioCC2541.h>
#include "hal_sleep.h"


/****************************************************************************
名    称: PowerMode()
功    能: 设置系统工作模式
入口参数: PM0:0，PM1:1，PM2:2，PM3:3 ，输入0恢复正常模式         
****************************************************************************/
void PowerMode(uint8 mode) 
{ 
    if(mode>0 && mode < 4) 
    {  
        SLEEPCMD |= mode;    //设置系统睡眠模式 
        PCON |= BV(0);         //进入PowerMode睡眠模式
    }else 
        PCON &= ~BV(0);         //从PowerMode恢复
}

/****************************************************************************
名    称: ST_ISR(void) 中断处理函数 
描    述: ST_VECTOR ：Sleep Timer Compare中断
****************************************************************************/
#pragma vector = ST_VECTOR 
__interrupt void ST_ISR(void) 
{ 
    STIF = 0;          //清标志位
    PowerMode(0);   //进入正常工作模式
} 

/****************************************************************************
名    称: InitSleepTimer()
功    能: 初始化休眠定时器,设定后经过指定时间自行唤醒
****************************************************************************/
void InitSleepTimer(void) 
{ 
    ST2 = 0X00; 
    ST1 = 0X0F; 
    ST0 = 0X0F; 
    EA = 1;     //开中断 
    STIE = 1;   //睡眠定时器中断使能 0： 中断禁止     1： 中断使能
    STIF = 0;   //睡眠定时器中断标志 0： 无中断未决   1： 中断未决
}

/****************************************************************************
* 名    称: SetSleepTime()
* 功    能: 设置睡眠时间 
* 入口参数: sec 睡眠时间             
****************************************************************************/
void SetSleepTime(int sec) 
{ 
    uint32 sleepTimer = 0; 
    //获取当前计数
    sleepTimer |= ST0; 
    sleepTimer |= (uint32)ST1 <<  8; 
    sleepTimer |= (uint32)ST2 << 16; 
    sleepTimer += ((uint32)sec * (uint32)32768); 
    //设置新的比较数值，计数到达后，产生中断。注意增加的计数一定要大于5
    ST2 = (uint8)(sleepTimer >> 16); 
    ST1 = (uint8)(sleepTimer >> 8); 
    ST0 = (uint8) sleepTimer; 
}